openfoam/OpenFOAM-dev/tutorials/incompressibleVoF/propeller/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh if necessary
if ! cloneMesh ../../incompressibleFluid/propeller .
then
    ./Allmesh
else
    runApplication decomposePar -noFields
fi

# Copy the fields into the processor directories
runApplication -a decomposePar -fields -copyZero

# Run
runParallel $(getApplication)

# Reconstruct
runApplication reconstructPar

#------------------------------------------------------------------------------
